1s/ERP/Conf/Documents/Лико_КартаСнятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_КартаСнятия</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСнятия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыСнятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВОплату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СостоянияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СостоянияЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВПлан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_КартаСнятия/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли; 
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ПроверитьНаличиеКартыСТакимиПараметрами(РежимЗаписи, Отказ);
	
	Если НЕ Отказ И Заказ.Состояние = Перечисления.Лико_СостоянияЗаказов.Закрыт И НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Кому = "Uchet@okil-sato.ru";
		Тема = "Создана карта снятия " + Номер + " к закрытому заказу " + Заказ.НомерБезПрефикса;
		ТекстПисьма = Тема;
		Лико_Планирование.ОтправитьПисьмо(ТекстПисьма, Тема, Кому);		
	КонецЕсли;

	
КонецПроцедуры

Процедура ПроверитьНаличиеКартыСТакимиПараметрами(РежимЗаписи, Отказ)
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		 Возврат;
	КонецЕсли;
	
	КартаУжеЕсть = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_КартаСнятия.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лико_КартаСнятия КАК Лико_КартаСнятия
		|ГДЕ
		|	Лико_КартаСнятия.Проведен
		|	И НЕ Лико_КартаСнятия.ПометкаУдаления
		|	И Лико_КартаСнятия.Заказ = &Заказ
		|	И Лико_КартаСнятия.НомерБланка = &НомерБланка
		|	И Лико_КартаСнятия.НомерПроката = &НомерПроката
		|	И Лико_КартаСнятия.Оператор = &Оператор
		|	И Лико_КартаСнятия.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("НомерПроката", НомерПроката);
	Запрос.УстановитьПараметр("НомерБланка", НомерБланка);
	Запрос.УстановитьПараметр("Оператор", Оператор);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КартаУжеЕсть = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если КартаУжеЕсть <> Неопределено Тогда
		
		ТекстОшибки =  СтрШаблон("Карта снятия по заказу № %1, бланку № %2 , прокату № %3 по оператору: ""%4"" уже была добавлена ( %5 от %6).",
		 Заказ.НомерБезПрефикса,
		 НомерБланка,
		 НомерПроката,
		 Оператор,
		 КартаУжеЕсть.Номер,
		 КартаУжеЕсть.Дата);
		Сообщить(ТекстОшибки);
		
		Отказ = Истина;
		
	КонецЕсли;


КонецПроцедуры
